<img style = 'float:left;' src = 'pand.png'>

* Overcomes the limitations of numpy arrays in dealing with labelled data
* Built on top of Numpy
* Introduces Series and DataFrame datastructures, which take on most of data mining

##  Pandas Series
* One-dimensional array of indexed data
* Built on top of numpy 1D array, and also has features similar to dictionaries
* Labels can be defined for a series' index

In [2]:
import numpy as np
import pandas as pd

### Creating series objects
* Can be created from a list, `numpy` array, tuple, or dictionary

from a list

In [3]:
# similar to numpy array except now we have an explicit index
my_series = pd.Series([0.5,0.8,0.9,1.3,0.4])
my_series

0    0.5
1    0.8
2    0.9
3    1.3
4    0.4
dtype: float64

In [4]:
my_series.values

array([0.5, 0.8, 0.9, 1.3, 0.4])

In [5]:
# returns an index object. We can get the same thing through my_series.keys()
list(my_series.index)

[0, 1, 2, 3, 4]

In [6]:
# index can be changed
my_series = pd.Series([1,2,3,4], index = ["a","b","c","d"])
my_series

a    1
b    2
c    3
d    4
dtype: int64

In [7]:
# one-dimensional array
my_series.shape

(4,)

from a `numpy` array

In [8]:
my_arr = np.array([8,7,6,5])
pd.Series(my_arr)

0    8
1    7
2    6
3    5
dtype: int64

from a tuple

In [9]:
tp = (11,12,9,1)
pd.Series(tp)

0    11
1    12
2     9
3     1
dtype: int64

from a dictionary

In [10]:
# keys=index, values=values
my_dict = {'k1':1, 'k2':3, 'k4':5}
pd.Series(my_dict)

k1    1
k2    3
k4    5
dtype: int64

In [11]:
my_series

a    1
b    2
c    3
d    4
dtype: int64

In [12]:
my_series2 = pd.Series([5,6,7,8], index = ["a","b","c","d"])
my_series2

a    5
b    6
c    7
d    8
dtype: int64

In [13]:
# element wise operations
my_series + my_series2

a     6
b     8
c    10
d    12
dtype: int64

In [14]:
d3 = {"k1": 2, "k2":[1,2,3], "k3":("a","b"),"k4":{"sk1":5}}
d3

{'k1': 2, 'k2': [1, 2, 3], 'k3': ('a', 'b'), 'k4': {'sk1': 5}}

In [15]:
pd.Series(d3)

k1             2
k2     [1, 2, 3]
k3        (a, b)
k4    {'sk1': 5}
dtype: object

### Indexing & Modifying Series Objects

#### Indexing

In [16]:
# Use square brackets [] for indexing
my_series = pd.Series([1.5,0.2,1.3,0.4], index=['a', 'b', 'c', 'd'])
my_series

a    1.5
b    0.2
c    1.3
d    0.4
dtype: float64

In [17]:
# explicit indexing by name of index (similar to indexing of a dictionary)
my_series['a']

np.float64(1.5)

In [18]:
# implicit indexing from 0th row to 2nd row
my_series[0:3]

a    1.5
b    0.2
c    1.3
dtype: float64

In [19]:
# getting the series elements in a reverse order
my_series[3::-1]

d    0.4
c    1.3
b    0.2
a    1.5
dtype: float64

In [20]:
my_series2 = pd.Series(['a', 'b', 'c', 'd', 'e'], index = [1,2,3,4,5])
my_series2

1    a
2    b
3    c
4    d
5    e
dtype: object

In [21]:
my_series2[1]

'a'

In [22]:
my_series2[1:4]
my_series2

1    a
2    b
3    c
4    d
5    e
dtype: object

**indexing attributes for `pandas` series and dataframes**
* .loc - for explicit indexing with names
* .iloc - for implicit indexing with row numbers or column numbers
* .ix - for mixed indexing

In [23]:
# explicit indexing with .loc
# provide actual row or index names
my_series2.loc[3]

'c'

In [24]:
my_series2.loc[1:]

1    a
2    b
3    c
4    d
5    e
dtype: object

In [25]:
# implicit indexing with .iloc
# provide row index
my_series2.iloc[3]

'd'

In [26]:
my_series2.iloc[1:]

2    b
3    c
4    d
5    e
dtype: object

#### Modifying Series

In [27]:
my_series2 = pd.Series(['a', 'b', 'c', 'd', 'e'], index = [1,2,3,4,5])
my_series2

1    a
2    b
3    c
4    d
5    e
dtype: object

In [28]:
my_series2.loc[5] = 'y'
my_series2

1    a
2    b
3    c
4    d
5    y
dtype: object

In [29]:
my_series2.loc[6] = 'z'
my_series2

1    a
2    b
3    c
4    d
5    y
6    z
dtype: object

In [30]:
# drop index with name or label 5
# not happening in place
my_series2.drop(5)
my_series2

1    a
2    b
3    c
4    d
5    y
6    z
dtype: object

## dataframes
* 2D array with labelled data.
* Sequence of aligned Series objects.
* Generalization of `numpy` array with labelled data
* Each row or column can be thought of as a is a series
* A dataframe can be thought of as a 2D numpy array with labelled rows and columns
* Also like a dictionary where column name is the key, and column data are values

dataframes can be created by reading csv files, a 2D numpy array, a dictionary, or series objects.

From a 2D numpy array

In [31]:
df = pd.DataFrame(np.random.rand(4,5))
df

          0         1         2         3         4
0  0.244353  0.580034  0.133263  0.036288  0.046240
1  0.768807  0.168348  0.240333  0.605218  0.437682
2  0.458748  0.354874  0.927225  0.788748  0.050685
3  0.946677  0.962879  0.015357  0.026332  0.630935

In [32]:
df = pd.DataFrame(np.random.rand(4,5), index = 'r1 r2 r3 r4'.split(), columns = 'c1 c2 c3 c4 c5'.split())
df

          c1        c2        c3        c4        c5
r1  0.109614  0.465922  0.131746  0.191946  0.611642
r2  0.701022  0.273296  0.726818  0.304429  0.037403
r3  0.607136  0.294041  0.538594  0.448081  0.642555
r4  0.334165  0.087835  0.290912  0.876082  0.480697

In [33]:
# index (basically row names) 
list(df.index)

['r1', 'r2', 'r3', 'r4']

In [34]:
# column names
list(df.columns)

['c1', 'c2', 'c3', 'c4', 'c5']

In [35]:
# df.keys() will get you the same result.
df.keys()

Index(['c1', 'c2', 'c3', 'c4', 'c5'], dtype='object')

From a dictionary of lists

In [36]:
df = pd.DataFrame({"k1":[1,2,3], "k2":["a","b","c"]})
df

   k1 k2
0   1  a
1   2  b
2   3  c

From lists

In [37]:
# we need to pass a list of lists
df = pd.DataFrame([[1,2,3,4]])
df

   0  1  2  3
0  1  2  3  4

In [38]:
df = pd.DataFrame([[1,2,3,4],["a","b","c","d"]], index='r1,r2'.split(","), columns='c1,c2,c3,c4'.split(","))
df

   c1 c2 c3 c4
r1  1  2  3  4
r2  a  b  c  d

From a dictionary of series or dictionary objects

In [39]:
d1 = {'Josh': 6, 'kevin': 5.5, 'kumar': 5.8, 'shelly': 4.9}
d2 = {'Josh': 180 , 'kevin': 150, 'kumar': 140, 'shelly': 120}
s1 = pd.Series(d1)
s2 = pd.Series(d2)
print ('s1\n', s1, '\n')
print ('s2\n', s2)

s1
 Josh      6.0
kevin     5.5
kumar     5.8
shelly    4.9
dtype: float64

s2
 Josh      180
kevin     150
kumar     140
shelly    120
dtype: int64

In [40]:
# created from a dictionary of series objects
df = pd.DataFrame({'height':s1, 'weight':s2})
df

        height  weight
Josh       6.0     180
kevin      5.5     150
kumar      5.8     140
shelly     4.9     120

In [41]:
# from a dictionary of dictionaries
df = pd.DataFrame({'height':d1, 'weight':d2})
df

        height  weight
Josh       6.0     180
kevin      5.5     150
kumar      5.8     140
shelly     4.9     120

**Reading a csv**

Exploring wine attributes

In [42]:
df = pd.read_csv('wine.csv')

In [43]:
# dimensions
df.shape

(178, 15)

In [44]:
# first few rows
df.head(3)

,Unnamed: 0,Type,Alcohol,Malic,Ash,Alcalinity,Magnesium,Phenols,Flavanoids,Nonflavanoids,Proanthocyanins,Color,Hue,Dilution,Proline
0,1,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,2,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,3,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185

In [45]:
# brief info on data frame columns and types
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 178 entries, 0 to 177
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Unnamed: 0       178 non-null    int64
 1   Type             178 non-null    int64
 2   Alcohol          178 non-null    float64
 3   Malic            178 non-null    float64
 4   Ash              178 non-null    float64
 5   Alcalinity       178 non-null    float64
 6   Magnesium        178 non-null    int64
 7   Phenols          178 non-null    float64
 8   Flavanoids       178 non-null    float64
 9   Nonflavanoids    178 non-null    float64
 10  Proanthocyanins  178 non-null    float64
 11  Color            178 non-null    float64
 12  Hue              178 non-null    float64
 13  Dilution         178 non-null    float64
 14  Proline          178 non-null    int64
dtypes: float64(11), int64(4)
memory usage: 21.0 KB

In [46]:
# brief staistics on all numeric type columns
df.describe()

,Unnamed: 0,Type,Alcohol,Malic,Ash,Alcalinity,Magnesium,Phenols,Flavanoids,Nonflavanoids,Proanthocyanins,Color,Hue,Dilution,Proline
count,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000
mean,89.500000,1.938202,13.000618,2.336348,2.366517,19.494944,99.741573,2.295112,2.029270,0.361854,1.590899,5.058090,0.957449,2.611685,746.893258
std,51.528309,0.775035,0.811827,1.117146,0.274344,3.339564,14.282484,0.625851,0.998859,0.124453,0.572359,2.318286,0.228572,0.709990,314.907474
min,1.000000,1.000000,11.030000,0.740000,1.360000,10.600000,70.000000,0.980000,0.340000,0.130000,0.410000,1.280000,0.480000,1.270000,278.000000
25%,45.250000,1.000000,12.362500,1.602500,2.210000,17.200000,88.000000,1.742500,1.205000,0.270000,1.250000,3.220000,0.782500,1.937500,500.500000
50%,89.500000,2.000000,13.050000,1.865000,2.360000,19.500000,98.000000,2.355000,2.135000,0.340000,1.555000,4.690000,0.965000,2.780000,673.500000
75%,133.750000,3.000000,13.677500,3.082500,2.557500,21.500000,107.000000,2.800000,2.875000,0.437500,1.950000,6.200000,1.120000,3.170000,985.000000
max,178.000000,3.000000,14.830000,5.800000,3.230000,30.000000,162.000000,3.880000,5.080000,0.660000,3.580000,13.000000,1.710000,4.000000,1680.000000

Indexing and slicing

In [47]:
# a particular column
df['Alcohol'].head()

0    14.23
1    13.20
2    13.16
3    14.37
4    13.24
Name: Alcohol, dtype: float64

In [48]:
# a list of columns
df[["Alcohol", "Phenols"]].head(3)

   Alcohol  Phenols
0    14.23     2.80
1    13.20     2.65
2    13.16     2.80

In [49]:
# list of row names
rnames = ['r' + str(i) for i in range(0,178)]
# assign these row names to the index
df.index = rnames
df.head()

,Unnamed: 0,Type,Alcohol,Malic,Ash,Alcalinity,Magnesium,Phenols,Flavanoids,Nonflavanoids,Proanthocyanins,Color,Hue,Dilution,Proline
r0,1,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
r1,2,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
r2,3,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
r3,4,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
r4,5,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

In [50]:
# explict indexing on rows
df.loc['r3']

Unnamed: 0            4.00
Type                  1.00
Alcohol              14.37
Malic                 1.95
Ash                   2.50
Alcalinity           16.80
Magnesium           113.00
Phenols               3.85
Flavanoids            3.49
Nonflavanoids         0.24
Proanthocyanins       2.18
Color                 7.80
Hue                   0.86
Dilution              3.45
Proline            1480.00
Name: r3, dtype: float64

In [51]:
# row 'r3', all columns
df.loc['r3',:]

Unnamed: 0            4.00
Type                  1.00
Alcohol              14.37
Malic                 1.95
Ash                   2.50
Alcalinity           16.80
Magnesium           113.00
Phenols               3.85
Flavanoids            3.49
Nonflavanoids         0.24
Proanthocyanins       2.18
Color                 7.80
Hue                   0.86
Dilution              3.45
Proline            1480.00
Name: r3, dtype: float64

In [52]:
df.head()

,Unnamed: 0,Type,Alcohol,Malic,Ash,Alcalinity,Magnesium,Phenols,Flavanoids,Nonflavanoids,Proanthocyanins,Color,Hue,Dilution,Proline
r0,1,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
r1,2,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
r2,3,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
r3,4,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
r4,5,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

In [53]:
# to get 2,3 rows and 1,2,3 columns
df.iloc[2:4,1:4]

    Type  Alcohol  Malic
r2     1    13.16   2.36
r3     1    14.37   1.95

In [54]:
# selecting multiple columns or rows, pass as a list. Also use .loc for indexing with names
df.loc[['r3', 'r4', 'r5'], ['Alcohol', 'Malic', 'Ash']].head()

    Alcohol  Malic   Ash
r3    14.37   1.95  2.50
r4    13.24   2.59  2.87
r5    14.20   1.76  2.45

### Other important methods

`df.max()`

In [55]:
# maximum value of a particular column
df['Alcohol'].max()

14.83

In [56]:
df.head(3)

,Unnamed: 0,Type,Alcohol,Malic,Ash,Alcalinity,Magnesium,Phenols,Flavanoids,Nonflavanoids,Proanthocyanins,Color,Hue,Dilution,Proline
r0,1,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
r1,2,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
r2,3,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185

In [57]:
# df.max(axis=0 or 1) to get the maximum value along each column or row. By default axis = 0
# axis = 0 will collapse values along rows, axis =1 will collapse along columns
df.max(axis=0)

Unnamed: 0          178.00
Type                  3.00
Alcohol              14.83
Malic                 5.80
Ash                   3.23
Alcalinity           30.00
Magnesium           162.00
Phenols               3.88
Flavanoids            5.08
Nonflavanoids         0.66
Proanthocyanins       3.58
Color                13.00
Hue                   1.71
Dilution              4.00
Proline            1680.00
dtype: float64

`df.idxmax()`

In [58]:
# index name where value is max
df['Alcohol'].idxmax()

'r8'

In [59]:
# for the whole dataframe, gives the index value for each column where max value occurs
df.idxmax()

Unnamed: 0         r177
Type               r130
Alcohol              r8
Malic              r123
Ash                r121
Alcalinity          r73
Magnesium           r95
Phenols             r52
Flavanoids         r121
Nonflavanoids      r105
Proanthocyanins    r110
Color              r158
Hue                r115
Dilution            r22
Proline             r18
dtype: object

`df.mean()`

In [60]:
# mean of each column
df.mean(axis=0)

Unnamed: 0          89.500000
Type                 1.938202
Alcohol             13.000618
Malic                2.336348
Ash                  2.366517
Alcalinity          19.494944
Magnesium           99.741573
Phenols              2.295112
Flavanoids           2.029270
Nonflavanoids        0.361854
Proanthocyanins      1.590899
Color                5.058090
Hue                  0.957449
Dilution             2.611685
Proline            746.893258
dtype: float64

`df.apply(func, axis)` can be used to apply any function across all columns or rows

In [61]:
df.apply(np.mean, 0)

Unnamed: 0          89.500000
Type                 1.938202
Alcohol             13.000618
Malic                2.336348
Ash                  2.366517
Alcalinity          19.494944
Magnesium           99.741573
Phenols              2.295112
Flavanoids           2.029270
Nonflavanoids        0.361854
Proanthocyanins      1.590899
Color                5.058090
Hue                  0.957449
Dilution             2.611685
Proline            746.893258
dtype: float64

In [62]:
df.head(2)

,Unnamed: 0,Type,Alcohol,Malic,Ash,Alcalinity,Magnesium,Phenols,Flavanoids,Nonflavanoids,Proanthocyanins,Color,Hue,Dilution,Proline
r0,1,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
r1,2,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050

In [63]:
# lists all the unique elements in wine 'Type' column
df['Type'].unique()

array([1, 2, 3])

In [64]:
# total number of unique values
df['Type'].nunique()

3

In [65]:
# frequency of each unique value
df['Type'].value_counts()

Type
2    71
1    59
3    48
Name: count, dtype: int64

In [66]:
# sort based on a particular column
df.sort_values('Alcohol')

,Unnamed: 0,Type,Alcohol,Malic,Ash,Alcalinity,Magnesium,Phenols,Flavanoids,Nonflavanoids,Proanthocyanins,Color,Hue,Dilution,Proline
r115,116,2,11.03,1.51,2.20,21.5,85,2.46,2.17,0.52,2.01,1.90,1.71,2.87,407
r113,114,2,11.41,0.74,2.50,21.0,88,2.48,2.01,0.42,1.44,3.08,1.10,2.31,434
r120,121,2,11.45,2.40,2.42,20.0,96,2.90,2.79,0.32,1.83,3.25,0.80,3.39,625
r110,111,2,11.46,3.74,1.82,19.5,107,3.18,2.58,0.24,3.58,2.90,0.75,2.81,562
r121,122,2,11.56,2.05,3.23,28.5,119,3.18,5.08,0.47,1.87,6.00,0.93,3.69,465
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
r46,47,1,14.38,3.59,2.28,16.0,102,3.25,3.17,0.27,2.19,4.90,1.04,3.44,1065
r14,15,1,14.38,1.87,2.38,12.0,102,3.30,3.64,0.29,2.96,7.50,1.20,3.00,1547
r6,7,1,14.39,1.87,2.45,14.6,96,2.50,2.52,0.30,1.98,5.25,1.02,3.58,1290
r13,14,1,14.75,1.73,2.39,11.4,91,3.10,3.69,0.43,2.81,5.40,1.25,2.73,1150
r8,9,1,14.83,1.64,2.17,14.0,97,2.80,2.98,0.29,1.98,5.20,1.08,2.85,1045

`df.groupby()` Another powerful method to group the data frame based on a column, and then apply some function

In [67]:
d = {"item":["chair", "desk", "rug", "table", "chair", "couch", "couch", "chair", "rug", "desk"], 
     "agent":["sally", "bob", "sally", "amy", "bob", "amy", "sally", "bob", "amy", "sally"],
      "sale_price": [100, 110, 200, 100, 150, 800, 1000, 100, 85, 110],
        "quantity": [10, 5, 15, 8, 20, 5, 4, 11, 9, 5]}

In [68]:
df = pd.DataFrame(d)
df['revenue'] = df['quantity']*df['sale_price']
df

    item  agent  sale_price  quantity  revenue
0  chair  sally         100        10     1000
1   desk    bob         110         5      550
2    rug  sally         200        15     3000
3  table    amy         100         8      800
4  chair    bob         150        20     3000
5  couch    amy         800         5     4000
6  couch  sally        1000         4     4000
7  chair    bob         100        11     1100
8    rug    amy          85         9      765
9   desk  sally         110         5      550

In [76]:
# only quantity, sale_price, revenue are returned because they are numeric and agent is not
mean_df = df.groupby("item").mean(numeric_only=True)

In [77]:
mean_df

       sale_price   quantity  revenue
item
chair  116.666667  13.666667   1700.0
couch  900.000000   4.500000   4000.0
desk   110.000000   5.000000    550.0
rug    142.500000  12.000000   1882.5
table  100.000000   8.000000    800.0

### Boolean Masking

Exploring a housing dataset

In [79]:
boston = pd.read_csv('boston_housing.csv')

In [80]:
boston.shape

(506, 15)

In [81]:
boston.head(3)

,Unnamed: 0,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7

In [82]:
boston.describe()

,Unnamed: 0,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
count,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000,506.000000
mean,252.500000,3.593761,11.363636,11.136779,0.069170,0.554695,6.284634,68.574901,3.795043,9.549407,408.237154,18.455534,356.674032,12.653063,22.532806
std,146.213884,8.596783,23.322453,6.860353,0.253994,0.115878,0.702617,28.148861,2.105710,8.707259,168.537116,2.164946,91.294864,7.141062,9.197104
min,0.000000,0.006320,0.000000,0.460000,0.000000,0.385000,3.561000,2.900000,1.129600,1.000000,187.000000,12.600000,0.320000,1.730000,5.000000
25%,126.250000,0.082045,0.000000,5.190000,0.000000,0.449000,5.885500,45.025000,2.100175,4.000000,279.000000,17.400000,375.377500,6.950000,17.025000
50%,252.500000,0.256510,0.000000,9.690000,0.000000,0.538000,6.208500,77.500000,3.207450,5.000000,330.000000,19.050000,391.440000,11.360000,21.200000
75%,378.750000,3.647423,12.500000,18.100000,0.000000,0.624000,6.623500,94.075000,5.188425,24.000000,666.000000,20.200000,396.225000,16.955000,25.000000
max,505.000000,88.976200,100.000000,27.740000,1.000000,0.871000,8.780000,100.000000,12.126500,24.000000,711.000000,22.000000,396.900000,37.970000,50.000000

In [83]:
# finding MEDV when # of rooms are high (> 8)
boston.loc[(boston['RM'] > 8), 'MEDV' ]

97     38.7
163    50.0
204    50.0
224    44.8
225    50.0
226    37.6
232    41.7
233    48.3
253    42.8
257    50.0
262    48.8
267    50.0
364    21.9
Name: MEDV, dtype: float64

In [ ]:
# use .loc for rows when using names or booleans
boston.loc[(boston['RM'] > 8), 'MEDV' ].mean()

In [85]:
# Finding the mean of MEDV where NOX is high
boston.loc[boston['NOX'] > 0.8,'MEDV'].mean()

np.float64(16.424999999999997)

In [86]:
# Finding the mean of MEDV where NOX is low
boston.loc[boston['NOX'] < 0.4,'MEDV'].mean()

np.float64(24.54285714285714)

In [88]:
# use &, | for multiple conditions and element wise comparison
boston.loc[(boston["RM"]>8) & (boston["LSTAT"] < 3),:]

,Unnamed: 0,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
204,204,0.02009,95.0,2.68,0.0,0.4161,8.034,31.9,5.1180,4.0,224.0,14.7,390.55,2.88,50.0
232,232,0.57529,0.0,6.20,0.0,0.5070,8.337,73.3,3.8384,8.0,307.0,17.4,385.91,2.47,41.7

### Modifying dataframes

In [89]:
df = pd.DataFrame([[0.1, 0.2, 0.3, 0.4], [1, 2, 3, 4], [10, 20, 30, 40]], index = 'r0 r1 r2'.split(), columns = 'c0 c1 c2 c3'.split())
df

      c0    c1    c2    c3
r0   0.1   0.2   0.3   0.4
r1   1.0   2.0   3.0   4.0
r2  10.0  20.0  30.0  40.0

In [90]:
# add a new column
df['c4'] = [0.5, 5, 50]
df

      c0    c1    c2    c3    c4
r0   0.1   0.2   0.3   0.4   0.5
r1   1.0   2.0   3.0   4.0   5.0
r2  10.0  20.0  30.0  40.0  50.0

`.assign()` to include multiple new columns

In [91]:
# doesn't happen in place
df.assign(c5 = [0.6, 6, 60], c6 = [0.7, 7, 70])

      c0    c1    c2    c3    c4    c5    c6
r0   0.1   0.2   0.3   0.4   0.5   0.6   0.7
r1   1.0   2.0   3.0   4.0   5.0   6.0   7.0
r2  10.0  20.0  30.0  40.0  50.0  60.0  70.0

In [92]:
df

      c0    c1    c2    c3    c4
r0   0.1   0.2   0.3   0.4   0.5
r1   1.0   2.0   3.0   4.0   5.0
r2  10.0  20.0  30.0  40.0  50.0

`.append()` to add by rows (column names should match)

In [93]:
df2 = pd.DataFrame([[7, 8, 9, 10, 11], [11, 21, 31, 41, 51]], index = 'r3 r4'.split(), columns = 'c0 c1 c2 c3 c4'.split())
df2

    c0  c1  c2  c3  c4
r3   7   8   9  10  11
r4  11  21  31  41  51

In [ ]:
df

`.pop()` can be used to remove a column

In [95]:
# returns the popped column and mutates the original df
df.pop("c4")
df

      c0    c1    c2    c3
r0   0.1   0.2   0.3   0.4
r1   1.0   2.0   3.0   4.0
r2  10.0  20.0  30.0  40.0

In [96]:
# add the column back
df["c4"] = [0.5, 5 ,50]
df

      c0    c1    c2    c3    c4
r0   0.1   0.2   0.3   0.4   0.5
r1   1.0   2.0   3.0   4.0   5.0
r2  10.0  20.0  30.0  40.0  50.0

`.drop()` to remove a column or row

In [99]:
# axis=1 is for columns
# set inplace=True if we want the original df to mutate
df.drop("c4", axis=1, inplace=True)
df

      c0    c1    c2    c3
r0   0.1   0.2   0.3   0.4
r1   1.0   2.0   3.0   4.0
r2  10.0  20.0  30.0  40.0

In [101]:
# to remove a row
df.drop('r2',axis=0)
df

      c0    c1    c2    c3
r0   0.1   0.2   0.3   0.4
r1   1.0   2.0   3.0   4.0
r2  10.0  20.0  30.0  40.0

`del` to delete columns

happens in place

also works for lists and dictionaries

In [103]:
del df['c3']
df

      c0    c1    c2
r0   0.1   0.2   0.3
r1   1.0   2.0   3.0
r2  10.0  20.0  30.0

reset index

In [104]:
df = pd.DataFrame(np.random.randint(0,10,(2,3)), index = 'r0 r1'.split(), columns = 'c0 c1 c2'.split())
df

    c0  c1  c2
r0   6   8   3
r1   3   3   1

In [105]:
# not inplace
df.reset_index(drop=False)

  index  c0  c1  c2
0    r0   6   8   3
1    r1   3   3   1

In [106]:
df

    c0  c1  c2
r0   6   8   3
r1   3   3   1

In [107]:
# to set a column as index. if inplace=False, original df unchanged
df.set_index("c2", inplace=True)

In [108]:
df

    c0  c1
c2
3    6   8
1    3   3

In [109]:
# give a new index
df.index = ['a', 'b']
df

   c0  c1
a   6   8
b   3   3

### Concatenating and merging

Use merge if we just want to add dataframes by rows or columns as long as all the index and column names are the same

`pd.concat` for concatenating rows or columns to an existing dataframe

In [110]:
df1 = pd.DataFrame(np.random.randn(3,4), index = 'r0 r1 r2'.split(), columns = 'c0 c1 c2 c3'.split())
df1

          c0        c1        c2        c3
r0 -0.566776 -0.077116  2.479818  1.048280
r1  3.702070 -0.485714 -1.867122 -0.892954
r2 -0.777658  0.639638  1.702117  0.684657

In [111]:
df2 = pd.DataFrame(np.random.randn(3,4), index = 'r0 r1 r2'.split(), columns = 'c4 c5 c6 c7'.split())
df2

          c4        c5        c6        c7
r0 -0.066362 -1.213730  0.741229  0.004413
r1  1.604619 -1.706908  1.066104 -0.436027
r2 -0.040908  0.622658 -0.943450 -0.003624

In [112]:
# axis = 1 for column, default is 0
# same row indexes, but differnt column names. We can use concat to join data frames together by column
pd.concat([df1,df2], axis=1)

,c0,c1,c2,c3,c4,c5,c6,c7
r0,-0.566776,-0.077116,2.479818,1.048280,-0.066362,-1.213730,0.741229,0.004413
r1,3.702070,-0.485714,-1.867122,-0.892954,1.604619,-1.706908,1.066104,-0.436027
r2,-0.777658,0.639638,1.702117,0.684657,-0.040908,0.622658,-0.943450,-0.003624

In [113]:
df1

          c0        c1        c2        c3
r0 -0.566776 -0.077116  2.479818  1.048280
r1  3.702070 -0.485714 -1.867122 -0.892954
r2 -0.777658  0.639638  1.702117  0.684657

In [114]:
df3 = pd.DataFrame(np.random.randn(3,4), index = 'r3 r4 r5'.split(), columns = 'c0 c1 c2 c3'.split())
df3

          c0        c1        c2        c3
r3  0.136199  1.047045  1.827024  0.440516
r4  0.246248 -0.299975  1.207225 -1.349912
r5 -0.079645  1.287530 -1.075374 -0.390192

In [115]:
# joining by rows
# column names must match here if we dont want any NaN. 
pd.concat([df1,df3], axis=0)

          c0        c1        c2        c3
r0 -0.566776 -0.077116  2.479818  1.048280
r1  3.702070 -0.485714 -1.867122 -0.892954
r2 -0.777658  0.639638  1.702117  0.684657
r3  0.136199  1.047045  1.827024  0.440516
r4  0.246248 -0.299975  1.207225 -1.349912
r5 -0.079645  1.287530 -1.075374 -0.390192

In [116]:
df1

          c0        c1        c2        c3
r0 -0.566776 -0.077116  2.479818  1.048280
r1  3.702070 -0.485714 -1.867122 -0.892954
r2 -0.777658  0.639638  1.702117  0.684657

In [117]:
df2

          c4        c5        c6        c7
r0 -0.066362 -1.213730  0.741229  0.004413
r1  1.604619 -1.706908  1.066104 -0.436027
r2 -0.040908  0.622658 -0.943450 -0.003624

In [118]:
# we get NaN because to join by rows, the column names are different
pd.concat([df1,df2], axis=0)

,c0,c1,c2,c3,c4,c5,c6,c7
r0,-0.566776,-0.077116,2.479818,1.048280,NaN,NaN,NaN,NaN
r1,3.702070,-0.485714,-1.867122,-0.892954,NaN,NaN,NaN,NaN
r2,-0.777658,0.639638,1.702117,0.684657,NaN,NaN,NaN,NaN
r0,NaN,NaN,NaN,NaN,-0.066362,-1.213730,0.741229,0.004413
r1,NaN,NaN,NaN,NaN,1.604619,-1.706908,1.066104,-0.436027
r2,NaN,NaN,NaN,NaN,-0.040908,0.622658,-0.943450,-0.003624

merge

In [120]:
df1 = pd.DataFrame([[1, 2, 3, 4], [2, 5, 6, 7], [3, 7, 5, 8]], columns = 'c0 c1 c2 c3'.split())
df1

   c0  c1  c2  c3
0   1   2   3   4
1   2   5   6   7
2   3   7   5   8

In [121]:
df2 = pd.DataFrame([[1, 21, 31, 41], [2, 51, 61, 71], [3, 71, 51, 81]], columns = 'c0 c5 c6 c7'.split())
df2

   c0  c5  c6  c7
0   1  21  31  41
1   2  51  61  71
2   3  71  51  81

In [122]:
# pandas automatically recognizes that each data frame has a common 'c0' column.
# we can also specify in the arguments that on = 'c0' 
df3 = pd.merge(df1, df2)
df3

   c0  c1  c2  c3  c5  c6  c7
0   1   2   3   4  21  31  41
1   2   5   6   7  51  61  71
2   3   7   5   8  71  51  81

In [123]:
# left_on and right_on when the column values might represent the same thing, but just the column names are different
df4 = pd.merge(df1,df2,how='inner', left_on = 'c0', right_on='c0') 
df4

   c0  c1  c2  c3  c5  c6  c7
0   1   2   3   4  21  31  41
1   2   5   6   7  51  61  71
2   3   7   5   8  71  51  81

### Missing Values

In [124]:
d = {"c0": [1,2,3,7,None,12], "c1": [4,12, 15, np.nan, 5, 8], "c2":[10, 11, np.nan, np.nan, 9, 12], "c3":[3,6,np.nan, 9, np.nan, 11]}
d

{'c0': [1, 2, 3, 7, None, 12],
 'c1': [4, 12, 15, nan, 5, 8],
 'c2': [10, 11, nan, nan, 9, 12],
 'c3': [3, 6, nan, 9, nan, 11]}

In [125]:
df = pd.DataFrame(d) 
df

     c0    c1    c2    c3
0   1.0   4.0  10.0   3.0
1   2.0  12.0  11.0   6.0
2   3.0  15.0   NaN   NaN
3   7.0   NaN   NaN   9.0
4   NaN   5.0   9.0   NaN
5  12.0   8.0  12.0  11.0

`.isnull()`

In [126]:
# dataframe of boolean values
df.isnull()

      c0     c1     c2     c3
0  False  False  False  False
1  False  False  False  False
2  False  False   True   True
3  False   True   True  False
4   True  False  False   True
5  False  False  False  False

In [127]:
# count of missing values in each column
df.isnull().sum(axis=0)

c0    1
c1    1
c2    2
c3    2
dtype: int64

`.notnull()`

In [128]:
# just the reverse of isnull
df.notnull()

      c0     c1     c2     c3
0   True   True   True   True
1   True   True   True   True
2   True   True  False  False
3   True  False  False   True
4  False   True   True  False
5   True   True   True   True

`.dropna()`

In [129]:
# select rows without any NaN values. axis = 0 is the default argument. default inplace = False
df.dropna()

     c0    c1    c2    c3
0   1.0   4.0  10.0   3.0
1   2.0  12.0  11.0   6.0
5  12.0   8.0  12.0  11.0

In [130]:
df

     c0    c1    c2    c3
0   1.0   4.0  10.0   3.0
1   2.0  12.0  11.0   6.0
2   3.0  15.0   NaN   NaN
3   7.0   NaN   NaN   9.0
4   NaN   5.0   9.0   NaN
5  12.0   8.0  12.0  11.0

In [132]:
# select columns without any NaN values
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [133]:
df

     c0    c1    c2    c3
0   1.0   4.0  10.0   3.0
1   2.0  12.0  11.0   6.0
2   3.0  15.0   NaN   NaN
3   7.0   NaN   NaN   9.0
4   NaN   5.0   9.0   NaN
5  12.0   8.0  12.0  11.0

In [134]:
# thresh is for non-NA values
df.dropna(axis = 0, thresh=3)

     c0    c1    c2    c3
0   1.0   4.0  10.0   3.0
1   2.0  12.0  11.0   6.0
5  12.0   8.0  12.0  11.0

In [135]:
# get any column which has at least 5 non missing values
df.dropna(axis=1, thresh=5)

     c0    c1
0   1.0   4.0
1   2.0  12.0
2   3.0  15.0
3   7.0   NaN
4   NaN   5.0
5  12.0   8.0

In [136]:
df

     c0    c1    c2    c3
0   1.0   4.0  10.0   3.0
1   2.0  12.0  11.0   6.0
2   3.0  15.0   NaN   NaN
3   7.0   NaN   NaN   9.0
4   NaN   5.0   9.0   NaN
5  12.0   8.0  12.0  11.0

`fillna()`

In [137]:
# fill missing values with a constant
df.fillna(100)

      c0     c1     c2     c3
0    1.0    4.0   10.0    3.0
1    2.0   12.0   11.0    6.0
2    3.0   15.0  100.0  100.0
3    7.0  100.0  100.0    9.0
4  100.0    5.0    9.0  100.0
5   12.0    8.0   12.0   11.0

In [139]:
# fill NA with mean values in each column. default inplace=False
df.fillna(df.mean(axis=0))

     c0    c1    c2     c3
0   1.0   4.0  10.0   3.00
1   2.0  12.0  11.0   6.00
2   3.0  15.0  10.5   7.25
3   7.0   8.8  10.5   9.00
4   5.0   5.0   9.0   7.25
5  12.0   8.0  12.0  11.00

In [140]:
df

     c0    c1    c2    c3
0   1.0   4.0  10.0   3.0
1   2.0  12.0  11.0   6.0
2   3.0  15.0   NaN   NaN
3   7.0   NaN   NaN   9.0
4   NaN   5.0   9.0   NaN
5  12.0   8.0  12.0  11.0

### Numerical operations

In [142]:
df1 = pd.DataFrame(np.random.randint(0,10,(3,4)), index = 'r0 r1 r2'.split(), columns='c0 c1 c2 c3'.split())
df2 = pd.DataFrame(np.random.randint(0,10,(3,4)), index = 'r0 r1 r2'.split(), columns='c0 c1 c2 c3'.split())
print (df1, '\n')
print (df2)

    c0  c1  c2  c3
r0   6   1   4   3
r1   7   1   1   8
r2   6   6   3   2

    c0  c1  c2  c3
r0   8   5   2   9
r1   8   1   8   6
r2   4   5   9   4

In [143]:
# broadcasting operations similar to numpy arrays
df1 + 8

    c0  c1  c2  c3
r0  14   9  12  11
r1  15   9   9  16
r2  14  14  11  10

In [144]:
df1

    c0  c1  c2  c3
r0   6   1   4   3
r1   7   1   1   8
r2   6   6   3   2

In [145]:
df1 + df2

    c0  c1  c2  c3
r0  14   6   6  12
r1  15   2   9  14
r2  10  11  12   6

`numpy` `ufunc`  will work on series and dataframes

In [146]:
np.exp(df1)

             c0          c1         c2           c3
r0   403.428793    2.718282  54.598150    20.085537
r1  1096.633158    2.718282   2.718282  2980.957987
r2   403.428793  403.428793  20.085537     7.389056

write to file

In [147]:
boston.to_csv('boston_copy.csv')